stress_test/socketio_senario.yml
config:
  target: "http://172.28.32.204:3000"
  phases:
    - duration: 10
      arrivalRate: 100
scenarios:
  - engine: "socketio"
    flow:
      - get:
          url: "/viewer"
      - emit:
          channel: "checkDomVersion"
          data: 3
        response:
          channel: "latestHtml"
          capture:
            json: "$"
            as: "data"
      - think: 200
      # - log: "Emitting captured values: {{ data }}"